pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR16DU20def.inc
.equ USERROW_USERROW333 = 0x134D         ; User Row 333
.equ USERROW_USERROW334 = 0x134E         ; User Row 334
.equ USERROW_USERROW335 = 0x134F         ; User Row 335
.equ USERROW_USERROW336 = 0x1350         ; User Row 336
.equ USERROW_USERROW337 = 0x1351         ; User Row 337
.equ USERROW_USERROW338 = 0x1352         ; User Row 338
.equ USERROW_USERROW339 = 0x1353         ; User Row 339
.equ USERROW_USERROW340 = 0x1354         ; User Row 340
.equ USERROW_USERROW341 = 0x1355         ; User Row 341
.equ USERROW_USERROW342 = 0x1356         ; User Row 342
.equ USERROW_USERROW343 = 0x1357         ; User Row 343
.equ USERROW_USERROW344 = 0x1358         ; User Row 344
.equ USERROW_USERROW345 = 0x1359         ; User Row 345
.equ USERROW_USERROW346 = 0x135A         ; User Row 346
.equ USERROW_USERROW347 = 0x135B         ; User Row 347
.equ USERROW_USERROW348 = 0x135C         ; User Row 348
.equ USERROW_USERROW349 = 0x135D         ; User Row 349
.equ USERROW_USERROW350 = 0x135E         ; User Row 350
.equ USERROW_USERROW351 = 0x135F         ; User Row 351
.equ USERROW_USERROW352 = 0x1360         ; User Row 352
.equ USERROW_USERROW353 = 0x1361         ; User Row 353
.equ USERROW_USERROW354 = 0x1362         ; User Row 354
.equ USERROW_USERROW355 = 0x1363         ; User Row 355
.equ USERROW_USERROW356 = 0x1364         ; User Row 356
.equ USERROW_USERROW357 = 0x1365         ; User Row 357
.equ USERROW_USERROW358 = 0x1366         ; User Row 358
.equ USERROW_USERROW359 = 0x1367         ; User Row 359
.equ USERROW_USERROW360 = 0x1368         ; User Row 360
.equ USERROW_USERROW361 = 0x1369         ; User Row 361
.equ USERROW_USERROW362 = 0x136A         ; User Row 362
.equ USERROW_USERROW363 = 0x136B         ; User Row 363
.equ USERROW_USERROW364 = 0x136C         ; User Row 364
.equ USERROW_USERROW365 = 0x136D         ; User Row 365
.equ USERROW_USERROW366 = 0x136E         ; User Row 366
.equ USERROW_USERROW367 = 0x136F         ; User Row 367
.equ USERROW_USERROW368 = 0x1370         ; User Row 368
.equ USERROW_USERROW369 = 0x1371         ; User Row 369
.equ USERROW_USERROW370 = 0x1372         ; User Row 370
.equ USERROW_USERROW371 = 0x1373         ; User Row 371
.equ USERROW_USERROW372 = 0x1374         ; User Row 372
.equ USERROW_USERROW373 = 0x1375         ; User Row 373
.equ USERROW_USERROW374 = 0x1376         ; User Row 374
.equ USERROW_USERROW375 = 0x1377         ; User Row 375
.equ USERROW_USERROW376 = 0x1378         ; User Row 376
.equ USERROW_USERROW377 = 0x1379         ; User Row 377
.equ USERROW_USERROW378 = 0x137A         ; User Row 378
.equ USERROW_USERROW379 = 0x137B         ; User Row 379
.equ USERROW_USERROW380 = 0x137C         ; User Row 380
.equ USERROW_USERROW381 = 0x137D         ; User Row 381
.equ USERROW_USERROW382 = 0x137E         ; User Row 382
.equ USERROW_USERROW383 = 0x137F         ; User Row 383
.equ USERROW_USERROW384 = 0x1380         ; User Row 384
.equ USERROW_USERROW385 = 0x1381         ; User Row 385
.equ USERROW_USERROW386 = 0x1382         ; User Row 386
.equ USERROW_USERROW387 = 0x1383         ; User Row 387
.equ USERROW_USERROW388 = 0x1384         ; User Row 388
.equ USERROW_USERROW389 = 0x1385         ; User Row 389
.equ USERROW_USERROW390 = 0x1386         ; User Row 390
.equ USERROW_USERROW391 = 0x1387         ; User Row 391
.equ USERROW_USERROW392 = 0x1388         ; User Row 392
.equ USERROW_USERROW393 = 0x1389         ; User Row 393
.equ USERROW_USERROW394 = 0x138A         ; User Row 394
.equ USERROW_USERROW395 = 0x138B         ; User Row 395
.equ USERROW_USERROW396 = 0x138C         ; User Row 396
.equ USERROW_USERROW397 = 0x138D         ; User Row 397
.equ USERROW_USERROW398 = 0x138E         ; User Row 398
.equ USERROW_USERROW399 = 0x138F         ; User Row 399
.equ USERROW_USERROW400 = 0x1390         ; User Row 400
.equ USERROW_USERROW401 = 0x1391         ; User Row 401
.equ USERROW_USERROW402 = 0x1392         ; User Row 402
.equ USERROW_USERROW403 = 0x1393         ; User Row 403
.equ USERROW_USERROW404 = 0x1394         ; User Row 404
.equ USERROW_USERROW405 = 0x1395         ; User Row 405
.equ USERROW_USERROW406 = 0x1396         ; User Row 406
.equ USERROW_USERROW407 = 0x1397         ; User Row 407
.equ USERROW_USERROW408 = 0x1398         ; User Row 408
.equ USERROW_USERROW409 = 0x1399         ; User Row 409
.equ USERROW_USERROW410 = 0x139A         ; User Row 410
.equ USERROW_USERROW411 = 0x139B         ; User Row 411
.equ USERROW_USERROW412 = 0x139C         ; User Row 412
.equ USERROW_USERROW413 = 0x139D         ; User Row 413
.equ USERROW_USERROW414 = 0x139E         ; User Row 414
.equ USERROW_USERROW415 = 0x139F         ; User Row 415
.equ USERROW_USERROW416 = 0x13A0         ; User Row 416
.equ USERROW_USERROW417 = 0x13A1         ; User Row 417
.equ USERROW_USERROW418 = 0x13A2         ; User Row 418
.equ USERROW_USERROW419 = 0x13A3         ; User Row 419
.equ USERROW_USERROW420 = 0x13A4         ; User Row 420
.equ USERROW_USERROW421 = 0x13A5         ; User Row 421
.equ USERROW_USERROW422 = 0x13A6         ; User Row 422
.equ USERROW_USERROW423 = 0x13A7         ; User Row 423
.equ USERROW_USERROW424 = 0x13A8         ; User Row 424
.equ USERROW_USERROW425 = 0x13A9         ; User Row 425
.equ USERROW_USERROW426 = 0x13AA         ; User Row 426
.equ USERROW_USERROW427 = 0x13AB         ; User Row 427
.equ USERROW_USERROW428 = 0x13AC         ; User Row 428
.equ USERROW_USERROW429 = 0x13AD         ; User Row 429
.equ USERROW_USERROW430 = 0x13AE         ; User Row 430
.equ USERROW_USERROW431 = 0x13AF         ; User Row 431
.equ USERROW_USERROW432 = 0x13B0         ; User Row 432
.equ USERROW_USERROW433 = 0x13B1         ; User Row 433
.equ USERROW_USERROW434 = 0x13B2         ; User Row 434
.equ USERROW_USERROW435 = 0x13B3         ; User Row 435
.equ USERROW_USERROW436 = 0x13B4         ; User Row 436
.equ USERROW_USERROW437 = 0x13B5         ; User Row 437
.equ USERROW_USERROW438 = 0x13B6         ; User Row 438
.equ USERROW_USERROW439 = 0x13B7         ; User Row 439
.equ USERROW_USERROW440 = 0x13B8         ; User Row 440
.equ USERROW_USERROW441 = 0x13B9         ; User Row 441
.equ USERROW_USERROW442 = 0x13BA         ; User Row 442
.equ USERROW_USERROW443 = 0x13BB         ; User Row 443
.equ USERROW_USERROW444 = 0x13BC         ; User Row 444
.equ USERROW_USERROW445 = 0x13BD         ; User Row 445
.equ USERROW_USERROW446 = 0x13BE         ; User Row 446
.equ USERROW_USERROW447 = 0x13BF         ; User Row 447
.equ USERROW_USERROW448 = 0x13C0         ; User Row 448
.equ USERROW_USERROW449 = 0x13C1         ; User Row 449
.equ USERROW_USERROW450 = 0x13C2         ; User Row 450
.equ USERROW_USERROW451 = 0x13C3         ; User Row 451
.equ USERROW_USERROW452 = 0x13C4         ; User Row 452
.equ USERROW_USERROW453 = 0x13C5         ; User Row 453
.equ USERROW_USERROW454 = 0x13C6         ; User Row 454
.equ USERROW_USERROW455 = 0x13C7         ; User Row 455
.equ USERROW_USERROW456 = 0x13C8         ; User Row 456
.equ USERROW_USERROW457 = 0x13C9         ; User Row 457
.equ USERROW_USERROW458 = 0x13CA         ; User Row 458
.equ USERROW_USERROW459 = 0x13CB         ; User Row 459
.equ USERROW_USERROW460 = 0x13CC         ; User Row 460
.equ USERROW_USERROW461 = 0x13CD         ; User Row 461
.equ USERROW_USERROW462 = 0x13CE         ; User Row 462
.equ USERROW_USERROW463 = 0x13CF         ; User Row 463
.equ USERROW_USERROW464 = 0x13D0         ; User Row 464
.equ USERROW_USERROW465 = 0x13D1         ; User Row 465
.equ USERROW_USERROW466 = 0x13D2         ; User Row 466
.equ USERROW_USERROW467 = 0x13D3         ; User Row 467
.equ USERROW_USERROW468 = 0x13D4         ; User Row 468
.equ USERROW_USERROW469 = 0x13D5         ; User Row 469
.equ USERROW_USERROW470 = 0x13D6         ; User Row 470
.equ USERROW_USERROW471 = 0x13D7         ; User Row 471
.equ USERROW_USERROW472 = 0x13D8         ; User Row 472
.equ USERROW_USERROW473 = 0x13D9         ; User Row 473
.equ USERROW_USERROW474 = 0x13DA         ; User Row 474
.equ USERROW_USERROW475 = 0x13DB         ; User Row 475
.equ USERROW_USERROW476 = 0x13DC         ; User Row 476
.equ USERROW_USERROW477 = 0x13DD         ; User Row 477
.equ USERROW_USERROW478 = 0x13DE         ; User Row 478
.equ USERROW_USERROW479 = 0x13DF         ; User Row 479
.equ USERROW_USERROW480 = 0x13E0         ; User Row 480
.equ USERROW_USERROW481 = 0x13E1         ; User Row 481
.equ USERROW_USERROW482 = 0x13E2         ; User Row 482
.equ USERROW_USERROW483 = 0x13E3         ; User Row 483
.equ USERROW_USERROW484 = 0x13E4         ; User Row 484
.equ USERROW_USERROW485 = 0x13E5         ; User Row 485
.equ USERROW_USERROW486 = 0x13E6         ; User Row 486
.equ USERROW_USERROW487 = 0x13E7         ; User Row 487
.equ USERROW_USERROW488 = 0x13E8         ; User Row 488
.equ USERROW_USERROW489 = 0x13E9         ; User Row 489
.equ USERROW_USERROW490 = 0x13EA         ; User Row 490
.equ USERROW_USERROW491 = 0x13EB         ; User Row 491
.equ USERROW_USERROW492 = 0x13EC         ; User Row 492
.equ USERROW_USERROW493 = 0x13ED         ; User Row 493
.equ USERROW_USERROW494 = 0x13EE         ; User Row 494
.equ USERROW_USERROW495 = 0x13EF         ; User Row 495
.equ USERROW_USERROW496 = 0x13F0         ; User Row 496
.equ USERROW_USERROW497 = 0x13F1         ; User Row 497
.equ USERROW_USERROW498 = 0x13F2         ; User Row 498
.equ USERROW_USERROW499 = 0x13F3         ; User Row 499
.equ USERROW_USERROW500 = 0x13F4         ; User Row 500
.equ USERROW_USERROW501 = 0x13F5         ; User Row 501
.equ USERROW_USERROW502 = 0x13F6         ; User Row 502
.equ USERROW_USERROW503 = 0x13F7         ; User Row 503
.equ USERROW_USERROW504 = 0x13F8         ; User Row 504
.equ USERROW_USERROW505 = 0x13F9         ; User Row 505
.equ USERROW_USERROW506 = 0x13FA         ; User Row 506
.equ USERROW_USERROW507 = 0x13FB         ; User Row 507
.equ USERROW_USERROW508 = 0x13FC         ; User Row 508
.equ USERROW_USERROW509 = 0x13FD         ; User Row 509
.equ USERROW_USERROW510 = 0x13FE         ; User Row 510
.equ USERROW_USERROW511 = 0x13FF         ; User Row 511

;*************************************************************************
;** VPORTA - Virtual Ports
;*************************************************************************

.equ VPORTA_DIR = 0x0000                 ; Data Direction
.equ VPORTA_OUT = 0x0001                 ; Output Value
.equ VPORTA_IN = 0x0002                  ; Input Value
.equ VPORTA_INTFLAGS = 0x0003            ; Interrupt Flags

;*************************************************************************
;** VPORTC - Virtual Ports
;*************************************************************************

.equ VPORTC_DIR = 0x0008                 ; Data Direction
.equ VPORTC_OUT = 0x0009                 ; Output Value
.equ VPORTC_IN = 0x000A                  ; Input Value
.equ VPORTC_INTFLAGS = 0x000B            ; Interrupt Flags

;*************************************************************************
;** VPORTD - Virtual Ports
;*************************************************************************

.equ VPORTD_DIR = 0x000C                 ; Data Direction
.equ VPORTD_OUT = 0x000D                 ; Output Value
.equ VPORTD_IN = 0x000E                  ; Input Value
.equ VPORTD_INTFLAGS = 0x000F            ; Interrupt Flags

;*************************************************************************
;** VPORTF - Virtual Ports
;*************************************************************************

